In [65]:
a=np.array([1,2,3,4,5,6])
print(a[1:8:2])

[2 4 6]

In [66]:
b=np.array([[1,2,3,4,5],[6,7,8,9,0]])
print(b[0:2,3])

[4 9]

In [67]:
c=np.array(['sravani','vindhya','kalluri','dfjh'])
c.dtype

dtype('<U7')

In [68]:
import pandas as pd
df=pd.Series([1,2,1,4])
df1=pd.Series([1,3,4,4])
print(df==df1)
print(df.compare(df1))

0     True
1    False
2    False
3     True
dtype: bool
   self  other
1   2.0    3.0
2   1.0    4.0

In [69]:
df=pd.Series([74,'sravani',3571,9.42])
l=df.tolist()
print(type(l))
print(l)

<class 'list'>
[74, 'sravani', 3571, 9.42]

In [70]:
df=pd.Series([100,200,'pyhton',300.12,400])
n=np.array(df)
print(type(n))
print(n)

<class 'numpy.ndarray'>
[100 200 'pyhton' 300.12 400]

In [73]:
#list
df=pd.Series([1,2,3,4,5])
print("Create Series with Lists")
print(df)
#numpy
a=np.array(['ramu','sita','raju'])
df=pd.Series(a)
print("Create Series with Numpy")
print(df)
#dict
d={'s.no':1,'name':'Ramu','class':5}
df=pd.Series(d)
print("Create Series with Dict")
print(df)

Create Series with Lists
0    1
1    2
2    3
3    4
4    5
dtype: int64
Create Series with Numpy
0    ramu
1    sita
2    raju
dtype: object
Create Series with Dict
s.no        1
name     Ramu
class       5
dtype: object

In [77]:
d={'s.no':pd.Series([1,2,3,4]),"name":pd.Series(['ramu','sita','raju','suresh'])}
df=pd.DataFrame(d)
print(df)

   s.no    name
0     1    ramu
1     2    sita
2     3    raju
3     4  suresh

In [89]:
df=pd.Series([1,2,3,1,2,4,2,1,2,3,6,2,5,1,2])
f=df.value_counts()
print(f)

2    6
1    4
3    2
4    1
6    1
5    1
dtype: int64

In [92]:
a=np.array([1,2,3,4,5,6,7,8,9])
df=pd.DataFrame(a.reshape(3,3))
print(df)

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

In [102]:
df=pd.read_csv('Book1.csv')['Name']
print(df)

0      Raju
1    Ramesh
2      Sita
3    Geetha
4    Suresh
Name: Name, dtype: object

In [106]:
df=pd.read_csv('Book1.csv',usecols=['Name','rank'])
print(df)

     Name  rank
0    Raju   200
1  Ramesh  4532
2    Sita   432
3  Geetha   100
4  Suresh  3321

In [110]:
df=pd.read_csv('Book1.csv')
f=df.loc[:,['rank','Name','s.no']]
print(f)

   rank    Name  s.no
0   200    Raju     1
1  4532  Ramesh     2
2   432    Sita     3
3   100  Geetha     4
4  3321  Suresh     5

In [113]:
df[::-1]

   s.no    Name  rank
4     5  Suresh  3321
3     4  Geetha   100
2     3    Sita   432
1     2  Ramesh  4532
0     1    Raju   200